[{
    "id": "DOC001",
    "topic": "ISSS Overview – What ISSS Is & What It Does",
    "source_url": "https://www.sjsu.edu/isss/",
    "last_verified": "2025-01-30",
    "content": "International Student and Scholar Services (ISSS) provides immigration advising and co-curricular support programming for F-1 and J-1 international students and scholars.\n\nISSS cultivates a supportive and inclusive community by centralizing immigration advising resources and programming. The office supports students from before departure from their home country through arrival and all the way to graduation and OPT/STEM OPT.\n\nSections on the website:\n- About\n- New Students\n- Current F-1 Students\n- J-1 Exchange Visitors\n- Events and Programs\n- Resources\n\nQuick Links include: Immigration Policy Updates, Schedule an Appointment, Contact ISSS, ISpartan Hub, Study Tools.\n\nOther offerings include advising appointments (in-person or via Zoom), help with maintaining visa status, employment, and insurance.\n\nThe Global Spartan Scholarship provides financial support for new and continuing international students.\n\nCampus statistics shown:\n- #3 Top Master’s University hosting international students\n- 35,000+ total students\n- 2,500+ international students\n\nEvents and news sections highlight past events, workshops, cultural activities, and scholarship announcements."
},
{
    "id": "DOC002",
    "topic": "Director’s Welcome – ISSS About Page",
    "source_url": "https://www.sjsu.edu/isss/about/",
    "last_verified": "2025-01-30",
    "content": "ISSS Director's Welcome\n\nDear International Students and Scholars,\n\nOn behalf of the ISSS team, I welcome you to San Jose State University (SJSU), San Jose, California, and the United States. Thank you for joining our vibrant and diverse community! We commend you on your decision to take steps to continue your education and/or research outside of your home country. You are taking the initial steps in becoming more globally engaged and a global citizen.\n\nPlease know that all of us at International Student & Scholar Services (ISSS) are here to support you throughout your time here at SJSU and beyond. Our goal, on a daily basis, is to ensure your success and make certain you are feeling well supported. As such, please don’t hesitate to reach out at any point in time.\n\nWe acknowledge and appreciate the diversity of thought, innovativeness, and the cultural enrichment you bring to an already diverse campus. The ISSS team of international educators and I very much look forward to serving your immigration and programming needs and enhancing your experience at SJSU. I hope to meet each and every one of you during your stay here.\n\nSincerely,\nParinaz Zartoshty, Ed.D.\nSenior Director, Global Programs and Services"
},
    
  {
    "id": "DOC003",
    "topic": "ISSS Mission, Vision, and Strategic Goals",
    "source_url": "https://www.sjsu.edu/isss/about/",
    "last_verified": "2025-01-30",
    "content": "Mission:\nInternational Student & Scholar Services (ISSS) cultivates a supportive and inclusive community by centralizing immigration advising resources and co-curricular support programming for F-1 and J-1 international students and scholars. ISSS is committed to the success and well-being of SJSU’s international community and strives to enhance the educational and social experiences of students and scholars.\n\nVision:\nSJSU ISSS welcomes, supports, and empowers international students and scholars to thrive academically, professionally, and personally. ISSS is committed to creating an inclusive campus culture and supporting holistic development while contributing to the growth of SJSU’s global community.\n\nStrategic Goals:\nGoal #1: Maintain a Student-Centered Approach\n- Provide relevant advising, services, and programming to meet the needs of international students, scholars, and recent graduates on OPT/STEM OPT.\n- Provide expert immigration knowledge and student-centered guidance.\n\nGoal #2: Foster Campus Internationalization\n- Promote global learning and collaborative opportunities for students, scholars, faculty, and staff.\n\nGoal #3: Champion International Student Advocacy & Campus Education\n- Advocate for international students through campus engagement and education on issues and policies affecting them.\n\nGoal #4: Commit to Team Development and Success\n- Provide training, technology, and tools for staff success.\n- Ensure all voices contribute to group decision-making.\n- Serve as a model for team performance and collaboration."
  },
  {
    "id": "DOC004",
    "topic": "ISSS Team Directory – Staff Roles & Biographies",
    "source_url": "https://www.sjsu.edu/isss/about/team",
    "last_verified": "2025-01-30",
    "content": "Full ISSS Team:\n\n1. Parinaz Zartoshty, Ed.D. – Senior Director, Global Programs and Services; PDSO/RO; institutional immigration policies; J-1 scholars; Campus Fulbright Liaison; Senior International Officer.\nBio: Originally from Tehran; BA Cornell, MA Boston University, Ed.D. SJSU. Experience with Amnesty International, UNICEF; multilingual; passionate about supporting international students.\n\n2. Suzanne Pendergrass – Associate Director; DSO/ARO; F-1 & J-1 advising; workshop facilitator.\nBio: Northern California native; BA Biola, MA NYU; advisor at MIIS, The New School, St. John's, Dartmouth; Peace Corps service; enjoys travel, movies, reading.\n\n3. Keri Toma Loehrer, Ed.D. – International Programs Manager; communications specialist; Global Spartan Welcome; Global Student Network.\nBio: From Maui; BA Asian Studies; MA in Teaching and MA in International Education Management; Ed.D. SJSU; decade of teaching experience; lived in Japan.\n\n4. Khim Lok – Senior International Student Services Coordinator; intake for J-1 scholars; insurance specialist.\nBio: From Union City/Milpitas; SJSU alum; first-generation college student; strong interest in geopolitical issues.\n\n5. Lena Meadows – International Student Advisor; DSO/ARO.\nBio: From Napa; SJSU grad; studied abroad at Waseda University; fluent in Japanese.\n\n6. Victoria Hudak – International Student Advisor.\nBio: Born in Yokosuka, Japan; lived in Italy; MA Middlebury; worked at UCSF and UC Santa Cruz.\n\n7. Elisa Yanagihashi – International Student Advisor.\nBio: Born in Japan; BA UWisconsin; MA Middlebury; experience at Santa Clara University and Foothill College.\n\n8. Ranali Dewaraja – International Student Advisor.\nBio: From Sri Lanka; attorney background; exchange semester in Germany; worked in Bay Area immigration law.\n\n9. Evelyn Tsao – Systems Analyst & SEVIS Coordinator; liaison for Admissions, Bursar, Registrar.\nBio: From Hebei, China; BA English Education; M.Ed SUNY Buffalo.\n\n10. Kenneth Ing – International Data/SEVIS Coordinator.\nBio: From Florida; BA University of Miami; worked in Japan through JET Program; former Disability Adjudicator.\n\nGlobal Leaders: ISSS student assistants who support events and foster community."
  },
  {
    "id": "DOC005",
    "topic": "ISSS Contact, Advising Hours, and Appointment System",
    "source_url": "https://www.sjsu.edu/isss/about/contact",
    "last_verified": "2025-01-30",
    "content": "ISSS Contact Information:\nLocation: Student Union – CPGE\nPhone: 408-924-5920\nEmail: international-office@sjsu.edu\n\nHoliday Closures: Nov 11; Nov 27–28; Dec 25–Jan 1.\n\nOffice Hours: Monday–Friday, 9:00 a.m.–4:30 p.m. (PST)\n\nISSS offers:\n- Front Desk Q&A for quick questions (Zoom + in-person)\n- Advisor Appointments for complex matters\n\nFront Desk Q&A (Quick Questions via Zoom):\nMonday–Thursday: 2:00pm–3:30pm\nFriday: 10:30am–12pm & 2:00pm–3:30pm\n(Closed on dates listed on website)\nQueue is first-come-first-served.\n\nAppointment Advising (Zoom & In-Person):\nAvailable Monday–Friday with rotating advisors: Elisa Yanagihashi, Lena Meadows, Victoria Hudak, Ranali Dewaraja, Suzanne Pendergrass.\n\nIn-Person Walk-In Advising:\nMonday–Friday: 10am–12pm & 2pm–4:30pm (with holiday exceptions)\nCheck in at CPGE first-floor reception.\n\nQuick questions include:\n- Insurance\n- Travel\n- Social Security\n- Enrollment verification\n- SEVP Portal issues\n- Form guidance\n- Campus navigation help\n\nComplex questions require an advising appointment.\n\nAdmissions questions should be directed to: global-students@sjsu.edu.\nPre-arrival admitted students should review the Pre-Arrival page and FAQ or email ISSS."
  },
  {
    "id": "DOC006",
    "topic": "New Students – Overview",
    "source_url": "https://www.sjsu.edu/isss/new-students/index.php",
    "last_verified": "2025-01-30",
    "content": "Welcome to San José State University! The New Students section provides essential information for beginning studies at SJSU. This page serves as a resource for international students before arrival, during entry to the U.S., and throughout the first weeks on campus.\n\nStudents are encouraged to review Pre-Arrival requirements, Post-Arrival steps, Living in San Jose information, housing guidelines, FAQs, immigration document requirements, and more. This site can be revisited at any time as a reference guide for new F-1 and J-1 students."
  },
  {
    "id": "DOC007",
    "topic": "Pre-Arrival Requirements – Visa Interview and Documents",
    "source_url": "https://www.sjsu.edu/isss/new-students/pre-arrival",
    "last_verified": "2025-01-30",
    "content": "After acceptance, students must prepare for their arrival at SJSU. Several steps should be completed before traveling to the United States.\n\n### Visa Interview\nAll international students must apply for and receive an F-1 visa before entering the U.S. U.S. Immigration and Customs Enforcement provides an overview of the F-1 visa application process at: Student Steps: How to Navigate the U.S. Immigration System.\n\n### SEVIS Fee\nBefore attending the F-1 visa interview, an online SEVIS fee payment of $350 is required. Students should print and keep a copy of the SEVIS fee receipt for permanent records.\n\n### Required Documents for the Visa Interview:\n- Passport\n- Form I-20\n- SJSU acceptance letter\n- Proof of financial support\n- SEVIS fee receipt\n\n### Visa Interview Expectations\nThe interview is typically brief (often under 10 minutes) and conducted in English. If denied, students should request the denial reason in writing and ask for a list of any required additional documents.\n\nStudents must clearly communicate their intention to return to their home country following completion of their studies.\n\nMore details about the visa process can be found on the Department of Homeland Security’s “Study in the States” website.\n\n### Mock Interview Resources\nSJSU provides:\n- Mock F-1 Visa Interview videos\n- Lists of common interview questions\n- Additional links explaining what to expect during the visa interview"
  },

  {
    "id": "DOC008",
    "topic": "Post-Arrival Requirements – First Weeks at SJSU",
    "source_url": "https://www.sjsu.edu/isss/new-students/post-arrival",
    "last_verified": "2025-01-30",
    "content": "Your first weeks at SJSU will be busy as you navigate orientations, registration, and settling into housing. Follow these steps to stay on track.\n\n### Clear All Account Holds Before Orientation\nStudents must log in to MySJSU regularly to monitor updates, messages, holds, and to-do items. ISSS sends immigration check-in instructions via MySJSU. All holds must be cleared before class registration during orientation.\n\n### Attend Campus Orientation & Global Spartan Welcome\nAll international students must complete two orientation components:\n1. Campus Orientation (Frosh, Transfer, or Graduate)\n2. Global Spartan Welcome (international-specific)\n\nExchange students are automatically registered for Global Spartan Welcome and do not need to attend a campus orientation program.\n\n### Get Your Tower ID Card\nTower Cards are issued at the Cashier’s Office in the Student Services Center. Students must present a passport or another photo ID. Undergraduates attending Sparta Camp may receive cards at orientation check-in if their photos were submitted on time.\n\nMore details: Bursar's Office → Tower Card page and FAQs."
  },
  {
    "id": "DOC009",
    "topic": "Living in San Jose – What to Bring",
    "source_url": "https://www.sjsu.edu/isss/new-students/living-in-san-jose",
    "last_verified": "2025-01-30",
    "content": "San Jose weather is warm in the afternoon and cooler in the evenings. Students should prepare for temperature changes.\n\n### Recommended Items to Pack:\n- Clothing: T-shirts, shirts, pants, jeans, shorts, sweatshirts, skirts, dresses, cardigans\n- Comfortable walking shoes (campus is 154 acres with 50+ major buildings)\n- Toiletries\n- Electronics adapter for 120V U.S. outlets\n\nA video resource is provided: 'SJSU Students Speak About What to Bring'."
  },
  {
    "id": "DOC010",
    "topic": "Living in San Jose – Transportation, Safety, Groceries, Banks, Phones",
    "source_url": "https://www.sjsu.edu/isss/new-students/living-in-san-jose",
    "last_verified": "2025-01-30",
    "content": "### Public Transportation\nStudents should visit the Transportation Solutions Office to obtain an Associated Students SmartPass Clipper Card. This provides unlimited rides on VTA buses and Light Rail lines. The office also offers information about regional public transportation, including BART and Caltrain.\n\nTrip planning resources:\n- 511.org\n- vta.org/trip-planner\n\n### E-Scooters & Bikes\nFord GoBike, Bird, and Lime scooters operate around downtown San Jose. Users must download the app. Scooters cannot be ridden on campus; fines may apply.\n\n### Ride Shares\nLyft and Uber are available. Discounts for SJSU students are sometimes offered.\n\n### Parking\nStudents driving to campus may use:\n- South Garage\n- West Garage\n- North Garage\n\nParking permit fees and maps: Parking Services website.\n\n### Security Resources\nCampus safety measures include bluelight emergency phones and SJSU’s Safe Ride Program (7:30 p.m. – 1:00 a.m.), offering free shuttle rides within a defined perimeter. UPD provides security support.\n\n### Grocery Stores near SJSU\n- Grocery Outlet – E. Santa Clara & 7th St (3 min walk)\n- Trader Joe’s – 635 Coleman Ave (8 min drive)\n- Mi Pueblo – 515 McLaughlin Ave (5 min drive)\n\n### Drugstores\n- CVS – 821 The Alameda (7 min drive)\n- Target – 533 Coleman Ave (7 min drive)\n- Walmart – 777 Story Rd (7 min drive)\n\n### Restaurants Nearby\nSan Pedro Square, Punjab Café, Tandoori Fusion Grill, Tofoo Com Chay (vegetarian), Ike’s Sandwiches, La Victoria Taqueria, Thai Chili Express, Spoon Fish Poke, Banh Mi Oven.\n\n### Bank Information\nATMs on campus: Chase, Wells Fargo, Bank of the West, Bank of America, US Bank. A US Bank branch is located in the Student Union.\n\nProvident Credit Union (official partner) provides accounts without requiring an SSN. Students must bring their I-94, Passport, and SJSU ID.\n\nNearby bank branches include:\n- Bank of America – 99 S. 4th St\n- Bank of the West – 50 W. San Fernando\n- Chase Bank – multiple locations\n- Wells Fargo – Park Center Plaza\n\n### International Payments via Flywire\nFlywire offers strong foreign exchange rates, home-currency payment options, and tracking service for international tuition payments. Students from India can use:\n- Flywire Student Forex Card (prepaid debit card)\n- Flywire Bank Transfer (LRS form required)\n\n### Currency Exchange\nStudents may exchange currency at airports or banks; recommended to have some USD before arrival.\n\n### Cell Phone Carriers\nMajor U.S. carriers include AT&T, Verizon, T-Mobile, and Sprint. Downtown locations:\n- T-Mobile – 100 E San Fernando St\n- Verizon – 66 W Santa Clara St\n\n### Driver’s License (California)\nStudents must be in the U.S. for at least 10 days before applying. Required documents include:\n- Passport\n- I-94 printout\n- I-20\n- Two proofs of residency (lease, bills)\n\nAppointments highly recommended. Website: dmv.ca.gov\n\n### Medical Assistance & Student Wellness\nThe SJSU Student Health Center provides primary care, immunizations, pharmacy access. The Wellness Center offers nutrition classes, violence prevention education, and stress-relief activities.\n\n### Recreation\nThe SJSU Recreation and Aquatic Center (SRAC) is included in tuition fees. Website: spartanrecreation.com\n\n### Student Service Center Resources\nOffices include:\n- Registrar (transcripts, enrollment, grade changes, residency, graduation, reinstatement)\n- Bursar (fees, payment plans, Tower Card)\n- GAPE (graduate evaluations, transfer credits, candidacy)\n\nThe center is located on the 1st floor of the 10th Street Parking Garage."
  },

  {
    "id": "DOC011",
    "topic": "Required Immigration Documents – Overview",
    "source_url": "https://www.sjsu.edu/isss/new-students/immigration-documents",
    "last_verified": "2025-01-30",
    "content": "International students must maintain valid immigration documents throughout their studies at SJSU. Students are responsible for keeping documents updated, unexpired, and in compliance with federal regulations.\n\n### Required Documents for All F-1 Students\n- **Valid Passport** – must remain valid at least 6 months into the future.\n- **Form I-20** – issued by SJSU; contains program dates, major, SEVIS ID.\n- **I-94 Arrival Record** – electronic arrival/departure record retrieved from https://i94.cbp.dhs.gov.\n- **F-1 Visa Stamp** – required for entry to the U.S. (not required if transferring schools within U.S.).\n\n### Keep Digital & Physical Copies\nStudents should keep:\n- Physical folder with originals\n- Scanned digital copies saved securely (cloud + USB)\n\n### Customs Inspection at U.S. Port of Entry\nOfficers may request:\n- Passport\n- F-1 visa\n- Original I-20\n- SEVIS receipt\n- Evidence of financial support\n\nStudents should be prepared to answer:\n- Purpose of entry (“to study at San José State University”)\n- Intended major\n- Funding sources\n\n### Automated Passport Control\nMost students will use automated kiosks at major airports but may still be referred for secondary inspection.\n\n### Important Note\nThe visa stamp does NOT determine how long a student can stay inside the U.S. Duration of stay is controlled by the I-20 program dates and maintenance of status."
  },
  {
    "id": "DOC012",
    "topic": "Immigration Document Details – Form I-20",
    "source_url": "https://www.sjsu.edu/isss/new-students/immigration-documents/i20",
    "last_verified": "2025-01-30",
    "content": "The Form I-20 \"Certificate of Eligibility for Nonimmigrant Student Status\" is issued by SJSU to confirm admission and eligibility for F-1 status.\n\n### Key Sections on the I-20\n- **SEVIS ID Number** – begins with 'N'; unique to each student.\n- **Program of Study** – degree level and major.\n- **Program Start and End Dates** – students must arrive no earlier than 30 days before the start date.\n- **Financials** – documentation of estimated expenses and proof of funding.\n- **School Information** – SJSU’s SEVIS school code and DSO signatures.\n\n### Student Responsibilities\n- Verify all details immediately upon receiving the I-20.\n- Sign and date the I-20 on page one.\n- Keep all I-20s ever issued (including old ones).\n\n### Transferring to SJSU (SEVIS Transfer)\nStudents already studying in the U.S. need a new SJSU I-20. Requirements:\n- Maintain full-time status at current school.\n- Request current school to release SEVIS record to SJSU.\n- Receive transfer-pending I-20.\n\n### Travel Signature\nLocated on page 2 of the I-20.\n- Valid **one year** for enrolled students.\n- Valid **six months** for students on OPT.\n\nStudents must plan ahead during peak travel seasons."
  },
  {
    "id": "DOC013",
    "topic": "Immigration Document Details – U.S. Visa Stamp",
    "source_url": "https://www.sjsu.edu/isss/new-students/immigration-documents/visa",
    "last_verified": "2025-01-30",
    "content": "The U.S. visa stamp is placed in the passport by a U.S. Consulate and authorizes a student to request entry into the United States in F-1 status.\n\n### Important Facts\n- A valid visa is required for **entry**, not for remaining in the U.S.\n- Visa validity can be single-entry or multiple-entry.\n- Visa expiration date does **not** determine how long a student can stay in the U.S.\n\n### Visa Renewal\nStudents outside the U.S. with expired visas must:\n- Schedule a visa renewal appointment\n- Present financial documents\n- Present updated I-20 with valid travel signature\n\n### Visa Denials\nA written explanation from the consulate should be requested. Students may reapply after addressing the concerns.\n\n### Visa Interview Tips\n- Answer clearly and honestly\n- Be prepared to show intent to return home after completing the degree\n- Present ties to home country"
  },
  {
    "id": "DOC014",
    "topic": "Immigration Document Details – Form I-94",
    "source_url": "https://www.sjsu.edu/isss/new-students/immigration-documents/i94",
    "last_verified": "2025-01-30",
    "content": "The I-94 record is the official document confirming a student’s admission to the U.S. in F-1 status.\n\n### Accessing the I-94\nStudents retrieve the electronic I-94 at: https://i94.cbp.dhs.gov\n\n### What the I-94 Shows\n- Date of entry\n- Class of admission (F-1)\n- 'D/S' notation (Duration of Status)\n- Admission number\n\n### Issues with I-94 Records\nOccasionally, the system may:\n- Not show a record\n- Show incorrect dates or status\n\nIf any issue occurs, students must:\n- Return to the Port of Entry office OR\n- Contact CBP Deferred Inspection Site immediately\n\n### Printed Copy\nStudents should print the I-94 and keep it with their passport and I-20 at all times for future immigration benefits (SSN, driver’s license, employment, OPT)."
  },
  {
    "id": "DOC015",
    "topic": "Immigration Document Details – Passport",
    "source_url": "https://www.sjsu.edu/isss/new-students/immigration-documents/passport",
    "last_verified": "2025-01-30",
    "content": "All international students must maintain a valid passport at all times while in the United States.\n\n### Validity Requirements\n- Passport must be valid **at least 6 months into the future**.\n- Renewal must occur before it expires.\n\n### Renewal\nStudents should contact their home country’s consulate or embassy in the U.S. to renew passports. Processing times vary widely.\n\n### Loss or Theft\nStudents must:\n- File a police report\n- Contact home country consulate for replacement\n- Inform ISSS if document replacement will affect visa or travel\n\n### Travel Considerations\nStudents cannot enter the U.S. with an expired passport, even with a valid visa stamp.\n\n### Storage\nKeep the passport in a secure location. Avoid carrying it unless necessary."
  },
  {
    "id": "DOC016",
    "topic": "Housing Overview for New International Students",
    "source_url": "https://www.sjsu.edu/isss/new-students/housing",
    "last_verified": "2025-01-30",
    "content": "SJSU offers multiple on-campus housing options and provides guidance for students seeking off-campus housing in San José.\n\n### On-Campus Housing Options\n- **University Housing Services (UHS)** manages freshman and upper-division housing.\n- Types of housing include:\n  - Traditional residence halls\n  - Apartment-style units\n  - Suites and themed housing communities\n\n### Benefits of On-Campus Housing\n- Walking distance to classes\n- Furnished units\n- Meal plans available\n- Peer community support\n- Secure and monitored facilities\n\n### How to Apply\n- Students must submit:\n  - Housing Intent application\n  - Initial payment if required\n  - Proof of enrollment\n- Application portal: https://www.sjsu.edu/housing\n\n### Early Move-In\nAvailable for international students depending on arrival dates and ISSS orientation. Additional fees may apply.\n\n### Housing Contracts\n- Contracts are legally binding.\n- Cancellation fees may apply.\n- Students should carefully review the terms before signing.\n\n### Accessibility & Special Accommodations\nProvided through Accessible Education Center (AEC). Students must submit requests early.\n\n### Important Reminder\nOn-campus housing fills quickly. Students should apply as soon as the application opens."
  },
  {
    "id": "DOC017",
    "topic": "Off-Campus Housing Guide for SJSU Students",
    "source_url": "https://www.sjsu.edu/isss/new-students/housing/off-campus",
    "last_verified": "2025-01-30",
    "content": "San José offers a wide range of off-campus housing options, including apartments, shared rooms, homestays, and private rentals. ISSS provides guidance for navigating the rental market.\n\n### Common Off-Campus Housing Types\n- Studio apartments\n- 1–2 bedroom apartments\n- Shared rooms in student houses\n- Private room rentals\n\n### Recommended Search Platforms\n- **SJSU Off-Campus Housing Website**: https://offcampushousing.sjsu.edu\n- Zillow\n- Apartments.com\n- Facebook groups (use caution)\n\n### Lease Considerations\nStudents should understand:\n- Lease term (usually 12 months)\n- Security deposits\n- Utilities included or excluded\n- Move-in fees\n- Pet policies\n\n### Roommates\nStudents often share apartments to reduce costs. They should discuss:\n- Cleaning responsibilities\n- Quiet hours\n- Utility sharing\n\n### Scams Warning\nCommon red flags:\n- Asking for payment before viewing\n- Listings with no photos\n- Unusually low rent prices\n- Pressure to sign immediately\n\n### Transportation\nConsider proximity to VTA bus routes, light rail, or SJSU campus.\n\n### Safety Tips\n- Visit the neighborhood during daytime and nighttime\n- Confirm locks and security measures\n- Ask landlord for maintenance history"
  },
  {
    "id": "DOC018",
    "topic": "Temporary Housing for Newly Arriving Students",
    "source_url": "https://www.sjsu.edu/isss/new-students/housing/temporary",
    "last_verified": "2025-01-30",
    "content": "Students arriving in San José before securing permanent housing may need short-term accommodations.\n\n### Short-Term Housing Options\n- Hotels near SJSU (range from budget to mid-tier)\n- Hostels and shared accommodations\n- Extended-stay hotels with weekly rates\n- Airbnb or private rentals\n\n### Recommendations by ISSS\n- Students should book temporary housing early during peak arrival months (July–August, December–January).\n\n### Cost Considerations\nTypical nightly rates in San José:\n- Budget options: $75–100\n- Standard hotels: $120–160\n- Extended stay: varies by duration\n\n### Location Considerations\nStay within:\n- Downtown San José\n- Areas with reliable public transportation\n\n### Safety Tips\n- Avoid sharing personal documents with hosts\n- Verify identity and reviews before booking\n\n### Useful Links (text references)\n- SJSU Housing Resources: https://www.sjsu.edu/housing\n- ISSS housing recommendations page"
  },
  {
    "id": "DOC019",
    "topic": "Housing FAQ for New International Students",
    "source_url": "https://www.sjsu.edu/isss/new-students/housing/faq",
    "last_verified": "2025-01-30",
    "content": "Frequently asked questions regarding housing for new international students.\n\n### FAQ Topics\n\n#### 1. Should I live on or off campus?\n- On-campus: convenient, furnished, community support.\n- Off-campus: more independence, flexible pricing, variety.\n\n#### 2. Is there family housing?\n- Limited availability. Students with dependents should contact University Housing directly.\n\n#### 3. Can I arrive before housing contracts begin?\n- Early move-in may be available for international students for an additional fee.\n\n#### 4. How do I find roommates?\n- SJSU roommate finder tools\n- Off-campus housing website\n- Orientation groups\n\n#### 5. How far from campus do most students live?\n- Many live within 1–3 miles.\n- Popular areas include downtown SJ, Japantown, Rose Garden, Spartan Village.\n\n#### 6. What are average rental costs?\n- Shared room: $700–$1,000\n- Single room: $1,000–$1,400\n- Studio/1BHK: $1,700–$2,300\n\n#### 7. Are utility costs included?\n- Depends on the lease. Students must clarify before signing.\n\n#### 8. Are there ISSS-approved landlords?\n- No. ISSS does not endorse specific landlords. Students must research independently.\n\n#### 9. What documents do landlords typically require?\n- Passport and visa\n- I-20\n- Proof of funds\n- Co-signer information (sometimes required)"
  },

  {
    "id": "DOC020",
    "topic": "Life in San José – Overview",
    "source_url": "https://www.sjsu.edu/isss/new-students/life-in-san-jose",
    "last_verified": "2025-01-30",
    "content": "San José is located in Silicon Valley and offers diverse cultural, academic, and recreational opportunities.\n\n### Key Facts About San José\n- Third-largest city in California\n- Known for technology companies, startups, and innovation\n- Mediterranean climate with mild winters and warm summers\n\n### Transportation\n- **VTA Bus & Light Rail** – discounted passes for students\n- **BART** – connects to San Francisco and East Bay\n- **Caltrain** – commuter rail to Peninsula and SF\n- **Biking & Scooters** – available around the city\n\n### Weather\n- Average 300 sunny days per year\n- Winter: 50–60°F\n- Summer: 80–95°F\n\n### Cost of Living\nSan José has one of the highest living costs in the U.S.\n- Rent is largest expense\n- Utilities and groceries higher than national average\n\n### Safety Tips\n- Avoid walking alone late at night\n- Keep valuables secure\n- Use well-lit streets\n\n### Food & Culture\n- Large Asian, Indian, Vietnamese, Mexican, Middle Eastern communities\n- Numerous grocery stores catering to international cuisines\n\n### Recreation\n- Parks, hiking trails, museums, concerts, sports events\n- Nearby cities: San Francisco, Santa Cruz, Palo Alto"
  },
  {
    "id": "DOC021",
    "topic": "Banking for International Students",
    "source_url": "https://www.sjsu.edu/isss/new-students/banking",
    "last_verified": "2025-01-30",
    "content": "International students should open a U.S. bank account soon after arriving to manage finances, pay tuition, and receive refunds.\n\n### Why Open a U.S. Bank Account?\n- Easier to pay rent, tuition, and bills\n- Ability to receive direct deposits (on-campus jobs)\n- Avoid international transaction fees\n\n### Common Accounts\n- **Checking Account** – used for daily transactions, debit card usage\n- **Savings Account** – used for storing funds, earning small interest\n\n### Banks Popular with SJSU Students\n- Bank of America\n- Chase Bank\n- Wells Fargo\n- US Bank\n- Credit unions (e.g., KeyPoint, Star One)\n\n### Required Documents to Open an Account\n- Passport\n- I-20\n- I-94 arrival record\n- SJSU Admission Letter\n- Local address\n\n### Tips When Opening an Account\n- Ask about student or \"new to U.S.\" accounts with no monthly fees\n- Avoid overdraft features unless necessary\n- Enable fraud alerts\n\n### Digital Banking\nMost banks provide mobile apps for:\n- Bill pay\n- Money transfer (Zelle)\n- Mobile check deposit\n\n### International Transfers\nStudents may use:\n- Remitly\n- Wise\n- Bank wire transfers\n\nProcessing times and fees vary."
  },
  {
    "id": "DOC022",
    "topic": "Phone Plans & SIM Cards for International Students",
    "source_url": "https://www.sjsu.edu/isss/new-students/phone",
    "last_verified": "2025-01-30",
    "content": "Students should obtain a U.S.-based phone number as soon as possible for campus verification, banking, and communication.\n\n### Major Mobile Carriers\n- **AT&T**\n- **T-Mobile**\n- **Verizon**\n\n### Prepaid & Student-Friendly Options\n- Mint Mobile\n- Google Fi\n- Visible (by Verizon)\n- Metro by T-Mobile\n\nThese providers often have affordable plans, no contracts, and eSIM support.\n\n### Required Documents\n- Passport\n- U.S. phone-compatible device\n- Address for billing\n\n### Plan Types\n- Unlimited talk/text plans\n- Limited or unlimited data plans\n- International calling add-ons\n\n### SIM vs eSIM\n- eSIM activation available for most modern smartphones\n- Faster activation for new arrivals\n\n### Tips\n- Compare coverage in San José\n- Avoid long-term contracts\n- Consider group/family plans with roommates for discounts"
  },
  {
    "id": "DOC023",
    "topic": "Transportation in San José & Bay Area",
    "source_url": "https://www.sjsu.edu/isss/new-students/transportation",
    "last_verified": "2025-01-30",
    "content": "San José offers several public transportation options for students traveling to campus, grocery stores, or exploring the Bay Area.\n\n### Key Transit Systems\n- **VTA (Valley Transportation Authority)** – local buses and light rail\n- **BART** – regional rail connecting San José to the East Bay & San Francisco\n- **Caltrain** – commuter rail connecting San José to Peninsula and SF\n\n### Student Discounts\nSJSU provides discounted VTA passes for eligible students.\n- Check TSU or SJSU Transportation Services\n- Digital pass available on mobile apps\n\n### Getting Around\n- Biking & scooters available in downtown SJ\n- Rideshare (Uber, Lyft)\n- Car rentals for day trips (Zipcar available on/near campus)\n\n### Airport Access\n- **San José Mineta International Airport (SJC)** – closest airport\n- **SFO** and **OAK** accessible via BART + Caltrain combinations\n\n### Safety Tips\n- Keep belongings close while riding transit\n- Travel in well-lit areas at night\n- Follow posted rules and respect transit staff"
  },
  {
    "id": "DOC024",
    "topic": "Health Insurance for International Students",
    "source_url": "https://www.sjsu.edu/isss/new-students/health-insurance",
    "last_verified": "2025-01-30",
    "content": "All international students (F-1/J-1) enrolled at SJSU are required to maintain university-approved health insurance.\n\n### Mandatory Coverage\nInternational students are automatically enrolled in SJSU's insurance plan each semester.\nCoverage typically includes:\n- Doctor visits\n- Hospitalization\n- Emergency services\n- Mental health counseling\n- Prescription medications\n\n### Waivers\nStudents may request a waiver only if their alternate insurance meets strict U.S. and California requirements.\n- Waiver deadlines apply each semester\n- Proof of comparable coverage required\n\n### Using Your Insurance\nStudents receive an insurance card via email or online portal.\nUse it for:\n- Medical appointments\n- Pharmacy visits\n- Emergency care\n\n### Student Health Center\nLocated on campus; provides:\n- Primary care\n- Vaccinations\n- Sexual health services\n- Mental health counseling\nSome services may incur small fees even with insurance.\n\n### Emergency vs Urgent Care\n- **Emergency Room** – life-threatening issues\n- **Urgent Care** – non-life-threatening issues that need quick attention\n\nStudents should check copay and deductible details before seeking care."
  },
  {
    "id": "DOC025",
    "topic": "Immunization & TB Screening Requirements",
    "source_url": "https://www.sjsu.edu/isss/new-students/immunizations",
    "last_verified": "2025-01-30",
    "content": "New students must meet the CSU immunization requirements before enrolling in classes. Failure to provide proof may result in registration holds.\n\n### Required Vaccinations\n- **MMR** – Measles, Mumps, Rubella\n- **Varicella (Chickenpox)**\n- **Tdap** – Tetanus, Diphtheria, Pertussis\n- **Meningococcal** (for students under 22)\n\n### Recommended Vaccinations\n- Influenza (seasonal)\n- COVID-19 vaccines/boosters (depending on current guidelines)\n\n### TB Screening (for high-risk groups)\nSome international students must complete a TB risk assessment or TB test.\n\n### How to Submit Records\n- Upload to SJSU Student Health Portal (text reference)\n- Submit clear copies of vaccination cards or physician records\n\n### Deadlines\n- Must be completed before course registration\n\n### Common Issues\n- Missing dates\n- Unreadable documents\n- Records not in English\nStudents should request official translations if needed."
  },
  {
    "id": "DOC026",
    "topic": "Visa Interview",
    "source_url": "https://www.sjsu.edu/isss/new-students/index.php",
    "last_verified": "2025-01-30",
    "content": "Visa Interview\nPrior to entering the United States, you are required to apply for and receive an F-1 visa. U.S. Immigration and Customs Enforcement outlines the process of F-1 visa application at the following website; Student Steps: How to Navigate the US Immigration System. Before attending your visa interview, an online SEVIS fee payment of $350.00 is required. Please print and maintain a copy of this payment receipt in your permanent records.\nYou should take the following documents to your visa interview:\nPassport\nI-20\nSJSU acceptance letter\nProof of financial support\nSEVIS fee receipt\nMore Information\nExpect the visa interview to be very brief, (less than 10 minutes) and to be conducted in English. If you are denied the visa, please request the reason you were denied in writing, along with a list of the documents they require to obtain approval. It is important to clearly communicate that you intend to leave the U.S. after completion of your studies. You can learn more about the visa application process at the Department of Homeland Security’s Study in the States website.\n\nMock interview for F-1 Visa\n\nWatch this mock interview to know what to expect when applying for an F-1 Visa at a US Consulate. These are just a few of the questions that you might be asked.\nClick here for a list of additional questions.\nWhat to Expect During the Visa Interview\nLearn more about what to expect during an F-1 Visa Interview, and the documents you should prepare ahead of time.\nClick here for a list of additional questions."
  },

  {
    "id": "DOC027",
    "topic": "Post-Arrival",
    "source_url": "https://www.sjsu.edu/isss/new-students/index.php",
    "last_verified": "2025-01-30",
    "content": "Post-Arrival\nYour first few weeks at SJSU will be busy and action-packed. Here are some reminders to keep you on track while you are navigating orientation, course registration and settling in to your new housing.\nThings to do once you arrive at SJSU\nClear All Account Holds Before Campus Orientation\nYour MySJSU account is your primary portal for accessing updates and information. By logging into your account, you can view messages from various departments, holds and pending items on your to-do list. ISSS will be sending you messages regarding your immigration check-in via MySJSU, so make sure that you keep checking your account on a regular basis. In order to register for classes during campus orientation, you will need to remove all holds.\nBelow are some common holds placed on a student’s account:\n\nClick here to see the full picture\nAttend Campus Orientation & Global Spartan Welcome\nBy now, you should have already registered for a campus orientation program (frosh, transfer, graduate) and a Global Spartan Welcome program for international students. Attendance at both programs is required.\nIf you are an Exchange student, you are automatically registered for the Global Spartan Welcome, and you are not required to attend a campus orientation program.\nGet Your Tower ID Card\nThe Tower Card is your SJSU ID Card. Tower Cards are available at the Cashier's Officelocated in the Student Services Center. You will be required to show one form of photo ID, such as your passport or driver’s license. For more information, see theBursar's Office Tower Card page and the Tower Card list of frequently asked questions.\nUndergraduates attending Sparta Camp of the Spartan Experience for Transfers can pick up their Tower Card at orientation check-in if you submit a photo electronically by the deadline. Look for an email from the Bursar’s Office for details.\nAbout Us\nNew Students\nPre-Arrival\nPost-Arrival\nLiving in San Jose\nCurrent F-1 Students\nJ-1 Exchange Visitors\nEvents & Programs\nResources\nContact Us\nSan José State University\nOne Washington Square\nStudent Union - CPGE\nSan Jose, CA 95192-0135"
  },

  {
    "id": "DOC028",
    "topic": "Living in San Jose",
    "source_url": "https://www.sjsu.edu/isss/new-students/index.php",
    "last_verified": "2025-01-30",
    "content": "Living in San Jose\nWhat to bring\nSan Jose is hot in the afternoons and cooler in the evenings. We recommend that you bring enough layers with you so that you’re prepared for shifting temperatures throughout the day. Here are some items that you may want to pack:\nT-shirts, shirts, pants, jeans, shorts, sweatshirts, skirts, dresses, cardigan\nComfortable walking shoes- Our campus is over 154 acres with over 50 major buildings. You will want to bring shoes that can hold up to your multi-day orientation.\nToiletries\nAdapter- If you are bringing electronics from your home country, you will need an adapter that converts to 120 V.\nSJSU Students Speak About What to Bring\nPublic Transportation\nThere are many ways to get around campus and the downtown area. For public transportation, please visit the TransportationSolutionsOffice to obtain a Associated Students SmartPass Clipper Card. The card will allow you to have unlimited rides on VTA buses and Light Rail Lines. The office can also provide information on regional travel outside of San Jose as well as information on regional public transcription such as BART and Caltrain. You can also refer to the following sites for help with planning your trips:\n511.org\nvta.org/trip-planner\nE-Scooters and Bikes\nFor a fun way to get around downtown San Jose, you can try using a Ford GoBike, Bird, or Lime Scooters which can be found around campus. Before you ride, you will need to download the app. You will be charged for unlocking the scooter and for each minute of your ride. Please be aware that you can’t ride the scooter on campus. If you are caught or reported, you are likely to incur a fine by the University.\nRide Shares\nAnother transportation option is using a rideshare app such as Lyft or Uber. Throughout the year, these apps will periodically promote discounts to SJSU students for rides around certain distance from campus, so be on the look-out for special deals!\nParking\nIf you plan to drive to campus with your own car, there are 3 main garages you can use, which includes the South Garage, West Garage and North Garage. Please refer to this map for more information. For more information about your parking permit fees, please visit Parking Services.\nSecurity\nSJSU is committed to ensuring your safety. All across campus, you will find bluelight phones, which you can use to report an emergency or request an escort during the day or night. Also, during the evening from 7:30 p.m to 1:00 a.m, you can take advantage of SJSU’s Safe Ride Program which is a shuttle service that will provide a ride to all SJSU students within a specified perimeter. For all other aspects of campus safety, you can contact the UPD’s office.\nGroceries/Drugstores\nGroceries\nGrocery Outlet - E. Santa Clara and 7th St  (~ 3 minute walk from SJSU)\nTrader Joe’s - 635 Coleman Ave (~ 8 minute drive from SJSU)\nMi Pueblo - 515 McLaughlin Ave ( ~ 5 min drive from SJSU)\nDrugstore\nCVS -  821 The Alameda (~ 7 min drive from SJSU)\nTarget - 533 Coleman Ave (~7 min drive from SJSU)\nWalmart - 777 Story Rd ( ~ 7 min drive from SJSU)\nRestaurants\nDowntown San Jose offers a variety of restaurants within easy walking distance.\nSan Pedro Square - 87 N. San Pedro \n(~ 17 minute walk from SJSU)\nPunjab Café - 322 E. Santa Clara St\n(~ 4 minute walk from SJSU)\nTandoori Fusion Grill - 225 E Santa Clara\n(~ 5 minute walk from SJSU)\nTofoo Com Chay - 388 E. Santa Clara [vegetarian]\n( ~ 5 minute walk from SJSU)\nIke’s Sandwiches - 75 E. Santa Clara\n( ~ 10 minute walk from SJSU)\nLa Victoria Taqueria - 150 E San Carlos St\n( ~ 7 minute walk from SJSU)\nThai Chili Express - 304 E. Santa Clara St #D\n(~ 3 minute walk from SJSU)\nSpoon Fish Poke - 111 Paseo De San Antonio\n( ~ 5 min walk from SJSU)\nBanh Mi Oven - 221 E San Fernando St\n(~ 3 min walk from SJSU)\nBank Information:\nTo set up a bank account, you can either apply online or go in person to the bank that best matches you. There are many ATMs on campus such as Chase, Wells Fargo, Bank of the West, Bank of America, and US Bank. US Bank also has a branch on campus located in the Student Union. Here are some bank branches that are located in the downtown San Jose area:\nProvident Credit Union (official parnter with SJSU; ATM on campus).\nVisit https://providentcu.org/sjsu to learn more about services for SJSU students.\nNo SSN required to open a Checking or Credit Card account. Bring your I-94, Passport, and SJSU ID Card to any branch.\nBank of America - 99 S. 4th St (4 min walk from SJSU)\nBank of the West - 50 W. San Fernando (8 min walk from SJSU)\nChase Bank- 55 W Santa Clara St (10 min walk from SJSU)\nWells Fargo- 121 Park Center Plaza (10 min walk from SJSU)\nChase Bank - 99 E San Fernando St (6 min walk from SJSJ)\nInternational Wire Transfer:\nSJSU has partnered with Flywire to streamline the tuition payment process for international students. Flywire offers excellent foreign exchange rates, allowing students to pay in their home currency (in most cases) and save a significant amount of money compared to traditional banks. Students will be able to track the progress of their payments throughout the transfer process via a student dashboard. They  will be notified via email when San José State University receives the payment. Learn more about International Payments on the Bursar’s Office website.\nForex Card & Bank Transfer for Students from India\nEducation costs more than tuition -- think rent, textbooks, transportation, and other education-related incidentals. Flywire offers two great solutions to sending money abroad: Student Forex Card and Flywire Bank Transfer.\nStudent Forex Card\nFlywire Bank Transfer\nFlywire’s forex card is a pre-paid debit card that can be filled before departure –  perfect for incoming students or international travel!\nFlywire’s bank transfer provides fast, simple transfers from your bank in India to your bank in the U.S.\nSafer alternative to carrying cash\nNo foreign account required + easy ATM withdrawal\nLocks in the exchange rate\nAvoid expensive international transaction fees\nWhat you see is what you pay\nNo new platforms to learn or manage\nMost competitive rates in the market\nEasy repeat transfers –"
  },{
    "id": "DOC029",
    "topic": "Maintaining F-1 Status, Enrollment Requirements, Course Types, Exceptions",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Maintaining F-1 Status\nReview the following options for maintaining your F-1 Status\nEnrollment Requirements\nPost-Completion OPT\nSTEM OPT\nExceptions to Full-Time Enrollment\nOther Resources\n\nEnrollment Requirements\nPursue a full course of study (i.e., 12 units for UGRD and 9 units for GRAD).\nUnless authorized by ISSS for\nReduced Course Load\nConcurrent Enrollment\nCulminating Experience\nBe mindful of allowable online credits. Only one course or 3 units per a student's full-time enrollment can be online. The other remaining courses must be in-person or hybrid.\nIf you only have one course to complete in your final semester, this course cannot be online.\nMake progress towards degree completion.\nMaintain a valid I-20.\nKnow your expiration date.\nExtend in a timely manner.\nShorten - if finishing degree program earlier than expected.\nUpdate if major changes.\nMaintain a valid travel signature.\nValidity of 12 months, when pursuing degree.\nValidity of 6 months when on OPT/STEM OPT.\nReport a change of address within 10 days of moving via MySJSU.\nDo not engage in off-campus employment (paid or unpaid) without the proper employment authorization (i.e., CPT).\n\nCourse Types\nRequirements\n\nIn-person\nYou are required to meet regularly with a faculty member to complete the course requirements and attend lectures or other in-person interactive activities.\n\nHybrid\nYou are required to meet both in-person and online. The majority of course work may take place online, but students may be required to complete specific projects, tests, or orientations on the physical campus. This includes courses that require only a one-time meeting with a faculty member. Hybrid courses can be counted toward your F-1 full-time enrollment requirements as in-person courses.\n\nOnline\nYou are required to complete all course requirements, lectures, or other activities online. There are no required in-person meetings. A maximum of one online course or 3 units per semester can be counted towards your F-1 full-time enrollment requirement. However, this does not account for extra units for more than 12 units for undergraduates and 9 units for graduates.\n\nExceptions to Full-Time Enrollment\nReduced Course Load\nConcurrent Enrollment\nCulminating Experience\nOther Resources\nTraveling\nLeave of Absence\nFinal Semester and Year\nChanging Degree Level at SJSU\nTransferring In/Out"
  },
  {
    "id": "DOC030",
    "topic": "Post-Completion OPT and STEM OPT Requirements",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Post-Completion OPT\nWork within the dates of the authorized (EAD) Employment Authorization Document.\nAll employment (paid or unpaid) must be related to your major field of study.\nEmployment must be at least 20 hours per week, in order not to accrue unemployment days.\nDo not exceed an aggregate of 90 days of unemployment.\nReport employment via the SEVP portal or directly to ISSS within 10 days.\nReport a change of address within 10 days of moving via the SEVP portal.\nMaintain a valid travel signature.\nValidity of 6 months, when on OPT.\n\nSTEM OPT\nAll employment must be for an e-verified employer, related to your major field of study, paid, and at least 20 hours per week.\nReport employment and changes in employment within 10 days of the change, via the STEM OPT Employment Update e-form.\nReporting requirements at the following times: 6 months, 12 months, 18 months, 24 months.\nMaintain a valid travel signature.\nValidity of 6 months, when on STEM OPT.\nDo not exceed 150 days of unemployment, applied to the entire period of standard Post-completion and STEM OPT."
  },
  {
    "id": "DOC031",
    "topic": "Change of Address Requirements",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Change of Address\nAs an F-1 student, you must regularly report any address changes to a Designated School Official (DSO) to ensure that your information is correct in the Student and Exchange Visitor Information System (SEVIS). Federal regulations require that you report a change of address within 10 days of moving.\nIn MySJSU, the address type of SEVIS D is used for F-1 students to report your new residential (physical) address to SEVIS. Please follow the instructions below.\n\nIf you are currently enrolled at SJSU and have not yet graduated:\nAccess MySJSU in one.SJSU and find the Personal Information section\nClick “Add a new address” to find SEVIS D\nUpdate your U.S. residential (physical) address in SEVIS D within 10 days of moving\n(You may keep a different U.S. mailing address in Mail, but the address in SEVIS D must be where you live.)\n\nIf you have graduated from SJSU and are on OPT or STEM OPT:\nPlease update your address directly in the SEVP Portal. If you do not have access to the SEVP Portal, please complete the SEVP Portal Access Form.\nWhile you are participating in OPT or STEM OPT, you will need to update your address within 10 days of the change in the SEVP Portal instead of MySJSU."
  },
  {
    "id": "DOC032",
    "topic": "Changing Degree Level at SJSU",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Changing Degree Level at SJSU\nIf you have completed a Bachelor’s degree at SJSU and have been admitted to a Master’s degree program at SJSU, you will need to complete the Change of Education Level I-20 Request e-form and submit it to ISSS. After you have submitted your eform, ISSS will create a new I-20 for you and email you when your “Change of Education Level” I-20 is ready. Please note the following:\nIf there is more than 5 months between the last date of your attendance or OPT/STEM OPT end date and the start date of your new degree, you may not be eligible for a “Change of Education Level” I-20. Please contact ISSS before submitting your request eform. For updated information on SJSU semester start dates, please refer to the SJSU Registrar's Office.\nYou may request to obtain your “Change of Education Level” I-20 before the last date of your employment on OPT/STEM OPT, however, you must stop your employment the day before the semester start date of your new degree.\n\"Change of Education Level\" I-20 does not require a travel signature on the second page in order for you to be able to enter the U.S. You receive a \"Continued Attendance\" I-20 with a travel signature only after you are enrolled and have completed the new student immigration check-in."
  },
  {
    "id": "DOC033",
    "topic": "Culminating Experience Requirements",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Culminating Experience\nWhat is a culminating experience?\nA culminating experience is required for the completion of a master's or doctorate degree program. It is the final requirement to culminate your degree.\nAs an F-1 graduate student, you need to enroll in a minimum of 9 units each term to maintain your immigration status. However, you may qualify for a full-time exception, if you are not in your final semester of study while you are enrolled in your culminating experience course. A full-time exception allows you to maintain your F-1 status as a full-time student.\nYou are permitted to complete your Masters Project/Thesis Proposal course, Comprehensive Exam, or Creative Work along with your other courses in the same semester.\n\nHow to File the ISSS Culminating Experience Form\n1) Consult with your academic advisor to determine whether you are qualified for a full-time exception.\n2) Complete the Culminating Experience Confirmation - F-1 Students Only e-form.\nFor the fall semester, we start accepting these requests in iSpartan on July 15th.\nFor the spring semester, we start accepting these requests in iSpartan on November 15th.\n3) Once your department approves your request, our office will be notified. We will review the form and inform you if your request has been approved."
  },
  {
    "id": "DOC034",
    "topic": "Concurrent Enrollment",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Concurrent Enrollment\nTo maintain full-time status, F-1 students can enroll at another institution concurrently*. Per F-1 regulations, a full-time course load is a minimum of 12 units total for undergraduate students, and a minimum of 9 units total for graduate students. Of this minimum, ONLY one course (3-4 units) of online coursework may be counted towards the full-time enrollment.\nYou MUST be enrolled in at least 6 units at SJSU.\nYou will need to fill out the Concurrent Enrollment Request form and submit it to the ISSS office along with proof of your enrollment at the other school.\nThe course(s) must be at least 6 weeks in duration.\nYou must submit an unofficial transcript to ISSS upon completion."
  },
  {
    "id": "DOC035",
    "topic": "F-2 Dependent Addition Requirements",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Add Dependent(s) in F-2 Status\nA student in F-1 status is able to add either their spouse/partner and/or their unmarried child, under the age of 21, as a dependent in F-2 status.\nApplication Steps\nFill out and submit the Dependent F-2 I-20 Request e-form via the iSpartan Hub.\nUpload documents: marriage certificate (for spouse) or birth certificate (for child). If not in English, upload original + certified translation.\nFinancial Documentation\nYou will need to show an additional $5,000 per dependent.\nProcessing time is 5–7 business days."
  },
  {
    "id": "DOC036",
    "topic": "Ending My F-1 Status",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Ending My F-1 Status\nReasons you may end your F-1 status:\n- Approved for new immigration status\n- Leaving U.S. to finish degree abroad\n- Ending OPT/STEM OPT earlier\n- Withdrawing or taking leave from SJSU\n- Graduating and departing U.S.\n\nDo NOT end F-1 status if you plan to:\n- Work on OPT\n- Change education level at SJSU\n- Transfer SEVIS record\n\nHow to end your status:\nSubmit “End My F-1 Status” request to ISSS.\nOnce approved, your SEVIS record ends.\n\nFuture return to U.S. in F-1 status:\nYou must apply for a new Initial I-20 and new SEVIS ID.\nMay need to pay new SEVIS fee + apply for new visa.\n\nImpact on CPT/OPT:\nAfter ending F-1, you must complete 2 full-time semesters again before eligibility."
  },
  {
    "id": "DOC037",
    "topic": "Final Semester Requirements",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Final Semester\n2 Semesters Out:\nMeet academic advisor.\nDetermine enrollment + RCL needs.\nApply for graduation.\nPlan post-graduation options.\n\n1 Semester Out:\nSubmit Final Semester RCL.\nFinal course cannot be online.\nAttend OPT workshop.\nExtend I-20 if needed.\nChoose final plan:\n- New degree at SJSU\n- Transfer SEVIS\n- OPT\n- Depart U.S.\nMeet ISSS advisor if needed."
  },
  {
    "id": "DOC038",
    "topic": "I-20 Extension Requirements",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "I-20 Extension\nAn international student must extend before expiration.\nValid reasons:\n- Change of major\n- Research problems\n- Documented medical issues\nMust be in valid status, making normal progress, and have finances.\nInvalid reasons:\n- Extra non-required classes\n- Delaying graduation\n- Incompletes\n\nHow to Apply:\nMeet academic department.\nMeet ISSS advisor.\nSubmit I-20 Extension Request with:\n- Reason\n- Financial documents\n- Declaration of Finance\nProcessing time: 5–7 business days."
  },
  {
    "id": "DOC039",
    "topic": "Leave of Absence & Returning to SJSU",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Leave of Absence\nConsult ISSS + academic advisor.\nSubmit ISSS Leave of Absence Request.\nAuthorized early withdrawal allows 15-day grace period.\n\nReturning (Less Than 5 Months):\nEmail ISSS 2–3 months before return.\nProvide departure + return dates.\nSubmit Return from LOA Request.\nMust check in with ISSS within 1 week of arrival.\n\nReturning (More Than 5 Months):\nMust receive new I-20.\nProvide finances + passport + LOA Request.\nProcessing: 2–3 weeks.\nMust pay SEVIS fee + get new visa.\nRecord must be term activated to register.\nAttend Global Spartan Welcome."
  },
  {
    "id": "DOC040",
    "topic": "Reduced Course Load (RCL)",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Reduced Course Load (RCL)\nFull-time enrollment required unless approved.\nSubmit RCL by last day to add classes.\nDropping below full-time without approval violates status.\n\nRCL Reasons:\nAcademic Difficulty (first semester only)\nImproper Course Level Placement\nFinal Semester RCL\nMedical RCL\n\nMedical RCL requires:\nLetter from U.S. doctor/psychologist\nExact term, reason, signature, license number\n\nUnit Rules:\nMust be in at least 6 units at SJSU.\nOnly 3 units can be online.\nFinal course cannot be online."
  },
  {
    "id": "DOC041",
    "topic": "Travel and Re-entry",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Travel and Re-Entry to the United States\nCBP may inspect documents + electronic devices.\nAvoid non-essential travel.\n\nRe-entry Documents:\nPassport (valid 6+ months)\nF-1 visa\nI-20 with travel signature (under 1 year old; 6 months if on OPT)\nRecommended: Transcript, financial proof, receipts, SEVIS fee receipt\n\nTravel Signatures:\nComplete Travel Signature Request.\nProcessing: 2–3 business days.\n\nStudents on OPT:\nCarry EAD card + employment letter.\n\nVisa Renewal:\nOnly needed if traveling outside U.S.\nInterview documents include passport, I-20, SEVIS fee, financial proof, transcript.\n\nTemporary Admission (I-515A):\nIssued if documents incomplete. Must be resolved within 30 days.\n\nTypical Inspection Questions:\nPurpose of visit, where studying, funding, residence, duration, post-graduation plans."
  },
  {
    "id": "DOC042",
    "topic": "Regain F-1 Status",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": ""
  },
  {
    "id": "DOC043",
    "topic": "Transfer In / Transfer Out",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": ""
  }, {
    "id": "DOC044",
    "topic": "Academic Integrity Overview",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Integrity\nTo learn more about San Jose State University’s policies, processes and on-campus resources regarding academic integrity please review the information in the links below.\nPolicies/Process\nStudent Resources\nForms\nVideo Resources\nIntegrity"
  },

  {
    "id": "DOC045",
    "topic": "Faculty Resources for Academic Integrity",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Faculty Resources\nThe Student Conduct and Ethical Development office provides detailed information for faculty and staff on SJSU’s Academic Integrity Policy and its processes.\nAcademic Integrity\nhttps://www.sjsu.edu/studentconduct/resources/faculty-staff-resources.php\nFaculty and Staff\nhttps://www.sjsu.edu/studentconduct/\nReporting Violations\nhttps://cm.maxient.com/reportingform.php?SanJoseStateUniv&layout_id=1\nStudent Conduct Process\nhttps://www.sjsu.edu/studentconduct/conduct-processes/student-conduct.php\nManaging Disruptive Behavior\nsjsu.edu/studentconduct/resources/faculty-staff-resources.php"
  },

  {
    "id": "DOC046",
    "topic": "Forms for Academic Integrity & Student Conduct",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Forms\nIf a faculty member feels that a violation of academic dishonesty (cheating and plagiarism), as stipulated in the Academic Integrity Policy (University Policy F15-7). has occurred, they can submit their concern on the Student Conduct and Ethical Development forms page. Faculty can also report all potential violations of the Student Conduct Code.\nForms\nStudent Conduct Forms"
  },

  {
    "id": "DOC047",
    "topic": "Policies & Process for Academic Integrity",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Policies & Process\nSan Jose State University is very clear on its Academic Integrity Policy. It is important that students pay attention to and understand the repercussions of not following the university rules and standards. Every student syllabus provides information to students on SJSU’s Academic Integrity Policy and SJSU faculty expect that students follow it.\nAcademic Integrity Policy\ncatalog.sjsu.edu/content.php?catoid=15&navoid=5381#academic-integrity-policy\nPolicies and Procedures\ncatalog.sjsu.edu/content.php?catoid=15&navoid=5385\nReporting Violations\nsjsu.edu/studentconduct/resources/faculty-staff-resources\nStudent Conduct Policies\nsjsu.edu/studentconduct/policies\nStudent Conduct Process\nhttps://www.sjsu.edu/studentconduct/conduct-processes/index.php\nStudent Rights and Responsibility\nsjsu.edu/ombudsperson/\n\nStudent Conduct and Ethical Development Brochure\nEnglish\nsjsu.edu/studentconduct/docs/SJSU-Student-Conduct-Code.pdf"
  },

  {
    "id": "DOC048",
    "topic": "Student Academic Integrity Resources",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Student Resources\nThere are many resources on campus for students who are unsure about how to move forward when struggling to meet the requirements of their course work. The university offers many options to help students navigate the system.\nTutoring Help\nPeer Connections Mentoring, Tutoring\nhttps://peerconnections.sjsu.edu/\nWriting Center\nhttps://www.sjsu.edu/writingcenter/\nCommunication Center\nhttps://commcenter.sjsu.edu/\nCollege of Science Advising Center (COSAC)\nPeer Tutoring for Biology, Chemistry, Computer Science, Math and Physics\nhttps://www.sjsu.edu/science-ssc/student-resources/tutoring/index.php\nSJSU Library Resources\nLearn how to recognize and avoid plagiarism\nhttps://libguides.sjsu.edu/plagiarism/what-is-plagiarism\nhttps://libguides.sjsu.edu/plagiarism/how-to-avoid-plagiarism\nLearn how to paraphrase well\nhttps://libguides.sjsu.edu/paraphrasing\nPlagiarism – Graduate Level\nhttps://library.sjsu.edu/plagiarism/home-page\nReading a Technical Paper\nhttps://libguides.sjsu.edu/c.php?g=850625&p=6086125\nWriting your Research Papers\nhttps://libguides.sjsu.edu/InfoLitOnline\nResearch Skills\nhttps://libguides.sjsu.edu/infopower/home\nHow to Cite\nhttps://libguides.sjsu.edu/c.php?g=230322&p=1528215"
  }, {
    "doc_id": "DOC049",
    "topic": "On-Campus Employment",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "On Campus Employment\nOn-Campus means the student is working physically on SJSU’s campus and is earning a paycheck from SJSU. Students in F-1 status can work on-campus up to 20 hours per week during the semester. For graduate students, there are some exceptions to the 20 hours-per-week rule. Be sure to check in the hiring department to see if you are eligible to work above 20 hours per week on-campus. During summer/winter breaks students can work on-campus full-time, provided they are eligible and enrolled for the upcoming semester.\n\nAll on-campus jobs require employment authorization (in the form of I-20 with approved work authorization), except for jobs in Dining Services, Spartan Bookstore, or other third-party vendors on campus.\n\nF-1 students are not eligible for Work Study positions. Students who are eligible for Work Study will have it noted in their Financial Aid Award letter.\n\nPlease review the full list of details on On-Campus Employment."
  }, {
    "doc_id": "DOC050",
    "topic": "Curricular Practical Training (CPT)",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Curricular Practical Training (CPT)\nCurricular Practical Training (CPT) is an off-campus work authorization for internship experiences or employment which is necessary for program completion. SJSU students can do CPT throughout the year if they meet the CPT eligibility requirements. Please read the CPT policy below in order to maintain your lawful F-1 status.\n\nWhat is CPT?\nCPT is for employment which is an integral part of an established curriculum. CPT employment must directly relate to your major field of study and is only available while students are in F-1 status and enrolled. A student can be authorized to do CPT on a semester basis. CPT employment authorization is written on Page 2 of your I-20.\n\nCPT is approved for a specific employer, location, time frame (start and end dates), and number of hours per week. CPT authorization is required each semester. Students can do CPT part-time of 20 hours or less per week or full-time of 21 hours or more per week. Students must stop working on the end date of their authorized CPT.\n\nPlease note, employment may not begin until the CPT is approved and properly noted on Page 2 of your I-20. If you do work without CPT authorization, then you will be in violation of your F-1 student status.\n\nCPT Eligibility Requirements:\nIn order to do CPT, students must:\n• Complete one academic year (one-year enrollment requirement) and be in valid F-1 status.\n• Have an eligible F-1 visa status requiring full-time enrollment.\n• Have a job offer that is directly related to your field of study.\n• Enroll in one credit of internship, academic training, co-op, or practicum class for the semester in which the internship occurs.\n• Be in good academic standing.\n• Meet the departmental internship course requirements.\n\nLimitations of CPT:\nIf you do 12 months or more of full-time CPT you will lose your eligibility for OPT. Pre-completion OPT has different rules and may be used in place of full-time CPT depending on your situation.\n\nCPT Application Procedures:\n1. Obtain an internship offer letter from your prospective employer.\n2. Enroll in the departmental internship course for the term of the internship.\n3. Submit the CPT I-20 Request to ISSS through the employment portal.\n4. Submit the CPT Agreement Form signed by employer and department.\n\nISSS will review your application. Processing times vary and students should not begin working until receiving the updated I-20 with CPT authorization on page 2.\n\nFailure to follow the CPT application procedures or working prior to authorization may result in a violation of F-1 status."
  }, {
    "doc_id": "DOC051",
    "topic": "Employer Guide for Hiring International Students",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Employer Guide\nStudents in F-1 status are eligible for practical training opportunities off-campus once specific eligibility requirements are met. The two main types of employment authorizations available for F-1 students are Curricular Practical Training (CPT) and Optional Practical Training (OPT). These employment authorizations allow international students to work legally in the United States.\n\nEmployers hiring F-1 students for internships or full-time roles should be aware of the following:\n\nCPT (Curricular Practical Training):\n• Allows students to engage in off-campus internships while enrolled in an academic program.\n• Authorization is granted by the university’s ISSS office.\n• CPT is employer-specific.\n• Students can work part-time (20 hours a week or less) or full-time (over 20 hours).\n• Students must obtain authorization prior to beginning employment.\n\nOPT (Optional Practical Training):\n• Post-completion OPT gives students up to 12 months of work authorization after graduating.\n• STEM majors may be eligible for an additional 24-month STEM OPT Extension.\n• OPT is not employer-specific, so students can work for any employer in their field of study.\n• Authorization is granted by USCIS, not the university.\n\nI-9 & E-Verify:\n• F-1 students on CPT or OPT may complete the I-9 process.\n• For STEM OPT, employers must be enrolled in E-Verify.\n\nEmployer Responsibilities:\n• Provide a training opportunity directly related to the student’s major.\n• Sign the required training or evaluation forms.\n• Follow federal regulations concerning employment of noncitizens.\n\nHiring F-1 students can help employers access highly skilled, multilingual, globally experienced talent with strong academic backgrounds."
  }, {
    "doc_id": "DOC052",
    "topic": "Pre-Completion OPT",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Pre Completion OPT\nOptional Practical Training (OPT) is employment authorization that allows students to gain practical experience in their field of study. Pre-Completion OPT takes place before a student's program end date.\n\nPre-Completion OPT Details:\n• Students may apply for Pre-Completion OPT while still enrolled in their degree program.\n• Employment must be directly related to the student’s major.\n• Students may work part-time (20 hours or less) while school is in session.\n• Students may work full-time during official university breaks or after completing all course requirements except the thesis or culminating experience.\n\nEligibility Requirements:\n• Must be in valid F-1 status.\n• Must have completed one academic year.\n• Must not have used more than 12 months of full-time OPT previously.\n\nApplication Process:\n1. Submit the OPT I-20 Request through the ISSS employment portal.\n2. Receive an updated I-20 with OPT recommendation.\n3. Submit Form I-765 and required documents to USCIS.\n4. Wait for Employment Authorization Document (EAD) approval before starting work.\n\nImportant Notes:\n• Pre-Completion OPT is deducted from the 12-month total OPT allocation.\n• USCIS processing time can take several months.\n• Students must report employment information while on Pre-Completion OPT.\n\nFailure to comply with OPT rules may result in a violation of F-1 status."
  }, {
    "doc_id": "DOC053",
    "topic": "Post-Completion OPT",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Post Completion OPT\nOptional Practical Training (OPT) is temporary employment authorization that allows F-1 students to gain practical experience in their major field of study. Post-Completion OPT is available after a student has completed their degree requirements.\n\nPost-Completion OPT Details:\n• Students may apply for 12 months of OPT upon program completion.\n• Employment must be directly related to the student’s major.\n• Students may work part-time (20 hours or less) or full-time (more than 20 hours).\n• Students must not accrue more than 90 days of unemployment.\n\nEligibility Requirements:\n• Must be in valid F-1 status.\n• Must have completed one academic year.\n• Must have completed all degree requirements.\n• Must not have used more than 12 months of full-time OPT previously.\n\nApplication Process:\n1. Submit the OPT I-20 Request to ISSS through the employment portal.\n2. Receive an updated I-20 with OPT recommendation.\n3. File Form I-765 with USCIS.\n4. Receive the Employment Authorization Document (EAD).\n5. Begin working only on or after the EAD start date.\n\nImportant Notes:\n• USCIS processing times can be several months.\n• STEM majors may be eligible for a 24-month STEM OPT Extension.\n• Students must complete required reporting while on OPT.\n• Students should keep their employment information updated to avoid violating status.\n\nStudents interested in Post-Completion OPT should review all requirements carefully before applying."
  }, {
    "doc_id": "DOC054",
    "topic": "Economic Hardship",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Economic Hardship\nF-1 students who experience severe economic hardship due to unforeseen circumstances may be eligible to apply for off-campus employment authorization.\n\nEconomic Hardship Details:\n• Authorization is granted by USCIS, not the university.\n• Students may work up to 20 hours per week while school is in session and full-time during breaks.\n• Employment does not need to be related to the student’s major.\n• Students may not begin working until receiving the EAD.\n\nEligibility Requirements:\n• Must have been in F-1 status for one academic year.\n• Must demonstrate severe, unforeseen economic need.\n• Must be in good academic standing.\n• Must show that on-campus employment opportunities are insufficient.\n\nExamples of Unforeseen Circumstances:\n• Substantial changes in currency value or exchange rate.\n• Loss of financial support.\n• Unexpected increases in tuition or living costs.\n• Medical expenses.\n• Natural disasters or crises in the student’s home country.\n\nApplication Process:\n1. Submit Economic Hardship I-20 Request to ISSS.\n2. Receive I-20 with recommendation for Economic Hardship.\n3. File Form I-765 with USCIS.\n4. Await approval and receive EAD.\n\nEconomic Hardship employment authorization is temporary and must be renewed if needed."
  }, {
    "doc_id": "DOC055",
    "topic": "Special Student Relief",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "[No content was provided in the user's paste. Placeholder document created per instruction 1A.]"
  }, {
    "doc_id": "DOC056",
    "topic": "SEVP Portal",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "SEVP Portal\nThe SEVP Portal allows F-1 students on OPT or STEM OPT to update their personal and employment information as required by federal regulations.\n\nStudent Responsibilities in the SEVP Portal:\n• Update employer name and address.\n• Update residential address.\n• Report changes in employment.\n• Ensure all information is accurate within 10 days of any change.\n\nAccessing the Portal:\n• Students receive a portal activation email from SEVP after OPT approval.\n• The email contains a unique link to create a password.\n• Students must use the same email they used for their I-765.\n\nTroubleshooting:\n• If the activation link expires, students may request a reset via ISSS.\n• Students should check spam/junk folders for the activation email.\n• Portal errors may require assistance from ISSS or SEVP.\n\nImportant Notes:\n• The SEVP Portal is separate from MySJSU.\n• Students on STEM OPT must complete Form I-983 and cannot solely rely on the SEVP Portal for reporting.\n• Failure to update portal information may lead to termination of SEVIS record.\n\nStudents should use the SEVP portal carefully and review all entries for accuracy."
  }, {
    "doc_id": "DOC057",
    "topic": "24-Month STEM OPT Extension",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "24 Month STEM Extension\nThe 24-Month STEM OPT Extension allows eligible F-1 students who completed a degree in a qualifying STEM field to apply for an additional 24 months of employment authorization beyond the initial 12 months of Post-Completion OPT.\n\nSTEM OPT Details:\n• Employment must be directly related to the student’s STEM degree.\n• Students must work at least 20 hours per week.\n• Employer must be enrolled in E-Verify.\n• Students must complete and submit Form I-983 (Training Plan) with their employer.\n• Students must receive regular evaluations and follow the training plan requirements.\n\nEligibility Requirements:\n• Must be currently on Post-Completion OPT.\n• Must have earned a degree in a DHS-designated STEM field.\n• Employer must be E-Verify registered.\n• Must not have exceeded 90 days of unemployment during Post-Completion OPT.\n\nApplication Process:\n1. Submit the STEM OPT I-20 Request to ISSS.\n2. Receive an updated I-20 with STEM OPT recommendation.\n3. File Form I-765 with USCIS.\n4. Continue employment for up to 180 days while the STEM OPT application is pending.\n\nImportant Notes:\n• Students cannot be self-employed on STEM OPT.\n• Volunteer positions do not qualify.\n• Students must report employment and verification checks every 6 months.\n• Students must submit annual self-evaluations on Form I-983.\n\nThe 24-Month STEM OPT Extension provides additional training time for students to gain practical experience in their STEM field."
  }
  , {
    "doc_id": "DOC058",
    "topic": "STEM OPT Reporting Requirements",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "STEM OPT Reporting Requirements\nStudents on the 24-Month STEM OPT Extension must follow specific reporting requirements in order to maintain F-1 status.\n\nReporting Requirements:\n• Report employment information within 10 days of any change.\n• Submit validation reports every 6 months.\n• Submit an annual self-evaluation (Form I-983).\n• Report termination of employment.\n\n6-Month Reporting:\nEvery 6 months, students must confirm the following:\n• Legal name\n• Residential address\n• Employer name and address\n• Continued employment\n\n12-Month and 24-Month Evaluations:\n• Students must submit a self-evaluation on Form I-983 at 12 months and again at 24 months.\n• Employers must review and sign these evaluations.\n\nChanges That Must Be Reported:\n• Employer name change\n• Employer address change\n• Supervisor change\n• Material changes to training plan\n• Termination or resignation\n\nFailure to comply with these reporting requirements may result in the termination of the student’s SEVIS record."
  }, {
    "doc_id": "DOC059",
    "topic": "Allowable Employment",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Allowable Employment\nF-1 students on OPT or STEM OPT must ensure that all employment meets federal eligibility requirements.\n\nAllowed Employment on OPT:\n• Paid employment directly related to the student’s major.\n• Multiple employers (all must be directly related to major).\n• Contract employment.\n• Self-employment (allowed only during Post-Completion OPT, not STEM OPT).\n• Short-term gigs, project-based work, or agency employment.\n\nAllowed Employment on STEM OPT:\n• Must be paid employment.\n• Employer must be E-Verify registered.\n• Work must be at least 20 hours per week.\n• Must follow Form I-983 training plan.\n• No self-employment.\n• No volunteer or unpaid work.\n\nStudents must ensure that all work performed is directly related to their field of study and complies with federal rules to maintain valid immigration status."
  }, {
    "doc_id": "DOC060",
    "topic": "iSpartan Hub",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "iSpartan Hub\n\niSpartan is a portal providing online services to SJSU F-1 and J-1 international students and scholars. This portal is used to submit and check the progress of service requests (e-forms).\n\niSpartan Login Instructions\n• Current & New Students (with active SJSUOne Account)\n• Prospective/Former SJSU Students/Scholars (with inactive SJSUOne Account)\n• Faculty and Staff\n\nFAQ's\n• FAQ for Students/Scholars\n• FAQ for Faculty and Staff\n\nF-1 Student Forms\n\nPractical Training – Information and Instructions\n• Curricular Practical Training (CPT) – E-form\n• Post Completion OPT – E-form\n• 24-Month STEM OPT Extension – E-form\n• SEVP Portal Access Form – E-form\n• STEM OPT Employment Update Report – E-form\n\nStudent Services – E-forms\n• Change of Education Level I-20 Request\n• Change of Status I-20 Request\n• Concurrent Enrollment Request\n• Culminating Experience Confirmation – F-1 Students Only\n• Declaration of Finance Form\n• Dependent F-2 I-20 Request\n• End My F-1 Status\n• Enrollment Verification Letter Request\n• Form I-20 Extension Request\n• Leave of Absence Request\n• New Student Immigration Check-In\n• Reduced Course Load Request\n• Replacement/Updated I-20 Request\n• Return to SJSU I-20 Request\n• Return from Leave of Absence I-20 Request\n• SEVIS Transfer Out Request\n• Travel Signature/I-20 Request"
  }, {
    "doc_id": "DOC061",
    "topic": "Scholarships (Global Spartan Scholarship, Louie Barozzi Scholarship)",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Scholarships\n\nInternational Student & Scholar Services offers scholarships for international students in F-1 status.\n\nGlobal Spartan Scholarship\nRecognizes and provides financial support to new and continuing international undergraduate and graduate students. Applicants must demonstrate:\n• Academic excellence\n• Leadership\n• Commitment to globalization/international education\n• Financial need\n\nLouie Barozzi Scholarship: International Students\nRecognizes SJSU international students for contributions to the community and commitment to international education and exchange.\nThree awards are given annually:\n• One international undergraduate student\n• One international graduate student\n• One Study Abroad & Away participant"
  }, {
    "doc_id": "DOC062",
    "topic": "Social Security Number and ITIN",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Social Security Number and ITIN\n\nWhat is a Social Security Number?\nA Social Security Number (SSN) is required for anyone who has employment in the US. It is used for tax purposes and to report wages. It is a 9-digit number issued by the Social Security Administration and is valid for life.\n\nWhen can I apply for an SSN?\nYou may apply once you have employment and a job offer letter.\nScenarios include:\n• F-1/J-1 student with on-campus job\n• F-1 student with CPT or OPT\n• J-1 student with academic training\n• J-1 scholar with an SJSU appointment\n\nRequirements:\n• Must be physically present in the US\n• Must wait 10 days after arriving\n• Must wait 2 business days after SEVIS validation\n• Must apply no more than 30 days before employment start\n\nApplication Steps:\n1. Obtain job offer letter\n2. Email ISSS the letter – ISSS will issue a support letter\n3. Complete SSA Form SS-5\n4. Bring job offer letter, ISSS letter, passport, I-94, and completed SS-5 to SSA office\n\nProcessing time: 2–4 weeks (estimated).\n\nWhen can you begin working?\nMost employers require SSN before starting work. Check employer policy.\n\nITIN – Individual Taxpayer Identification Number\nUsed for tax purposes when someone cannot obtain an SSN.\nITIN is required for:\n• Certain nonresidents\n• Those receiving taxable non-service scholarships or fellowships\n• Those with US-source income but not eligible for SSN\n\nF-1 and J-1 students eligible for SSNs should NOT apply for ITINs.\n\nITIN Application through ISSS requires verification of:\n• Passport bio page\n• I-20/DS-2019\n• F-1/J-1 visa stamp\n• I-94\n• Completed W-7\n• Completed W-8BEN (if claiming treaty benefits)\n\nISSS will provide a support letter confirming verification.\nFor further processing, students may need a locally-based certified agent."
  }, {
    "doc_id": "DOC063",
    "topic": "Student Resources",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Student Resources\n\nSJSU provides many academic support systems for students struggling with coursework requirements.\n\nTutoring Help\nPeer Connections – Mentoring and Tutoring\nhttps://www.sjsu.edu/peerconnections/\n\nWriting Center\nhttps://www.sjsu.edu/writingcenter/\n\nCommunication Center\nhttps://www.sjsu.edu/commcenter/\n\nCOSAC (College of Science Advising Center)\nPeer tutoring for Biology, Chemistry, Computer Science, Math, Physics\nhttps://www.sjsu.edu/science-ssc/student-resources/tutoring/\n\nSJSU Library Resources\n• How to recognize and avoid plagiarism\n• How to paraphrase\n• Copyright and Fair Use\n• Reading technical papers\n• Writing research papers\n• Research skills\n• How to cite\n\nLinks:\nhttps://library.sjsu.edu/plagiarism/what-is-plagiarism\nhttps://library.sjsu.edu/paraphrasing/home\nhttps://library.sjsu.edu/c.php?g=850625&p=6086125\nhttps://library.sjsu.edu/c.php?g=230322&p=10409900\nhttps://library.sjsu.edu/infopower/home\nhttps://library.sjsu.edu/c.php?g=230322&p=1528215"
  }, {
    "doc_id": "DOC064",
    "topic": "Study Tools / Tax Information (Part 1)",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Tax Information\n\nDiscounted Access to Sprintax Tax Preparation!\nLimited discount codes available. File early to secure a code.\n\nSteps:\n1. Register and follow instructions\n2. Complete questionnaire\n3. Enter unique code: SJSU1500F24\n4. Sprintax will prepare your tax return\n\nWho must file taxes?\nAnyone in the US on F or J status between Jan 1 – Dec 31, 2024 must file Form 8843.\nIf you earned taxable US income, you may need:\n• Federal tax return (1040NR)\n• State tax return (if applicable)\n\nDeadline:\nApril 15, 2025\n\nResident vs Nonresident for Tax Purposes:\n• Most F/J students are nonresidents for first 5 calendar years (F-1) or 2 calendar years (J-1)\n• After that, Substantial Presence Test applies\n\nOpen Tax Webinars (Jan–Apr 2025):\nMultiple dates provided for general filing information.\n\nSprintax Nonresident Tax Overview for OPT/CPT:\nCovers:\n• Residency determination\n• FICA exemption\n• Pre-employment tax forms\n\nSprintaxTDS Personal:\nHelps prepare pre-employment forms like W-4, 8233, W8-BEN.\nCost: $19.95\nIncludes: residency determination + FICA exemption check\n\nWho must file?\nAll F-1 students must file taxes each year.\nIf no income → only Form 8843\nIf income → 8843 + 1040NR or 1040NR-EZ + CA 540NR\n\nRequired documents:\n• Passport\n• I-20/DS-2019\n• SSN/ITIN (if any)\n• W-2\n• 1042-S\n• Travel history\n• 1099 (if applicable)\n• Do NOT use 1098-T (not valid for nonresidents)\n\nProcess:\n1. Create Sprintax account\n2. Complete questionnaire\n3. Sprintax determines residency\n4. Generates correct forms\n5. Download, print, sign, mail to IRS\n\nTax Assistance:\n• Sprintax support (email + 24/7 live chat)\n• VITA/TCE – may not assist with nonresident returns\n• Glacier – alternative provider\n\nDisclaimer: ISSS cannot provide tax advice."
  }, {
    "doc_id": "DOC065",
    "topic": "Housing for International Students",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Housing for International Students\n\nSan José State University offers many housing options for students, ranging from dormitories to apartment-style living and communal housing.\n\nNote: First-time freshmen are required to live on-campus.\n\nUniversity Housing\nProvides housing for freshmen, transfer students, and graduate students. Includes:\n• Dormitories\n• Apartment-style living\n• Communal housing\n\n*Meets freshman on-campus requirement.\nA campus housing tour for international students is available.\n\nOff-Campus Housing\nFinding housing in the Bay Area can be challenging. Students must be cautious of:\n• Scams\n• Unsafe situations\n\nTemporary Housing\nFor students who need short-term housing upon arrival:\n• Airbnb\n• Local hotels (university provides list)\n\nHomestay\nLive with an American family for cultural immersion. Managed by:\n• International Student Placements (ISP)\n\nInternational House (I-House)\nA residence for 70 U.S. and international students.\nProvides:\n• Community\n• Leadership opportunities\n• Group activities\n• Travel\n\n*Meets freshman on-campus requirement."
  }
,   {
    "doc_id": "DOC066",
    "topic": "Immigration Policy Updates",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Immigration Policy Updates\n\nChanges to immigration policy can be stressful, and ISSS provides guidance as updates occur.\nInformation may change, and users should verify details independently.\nA central SJSU immigration resources page is available.\n\nRecent Updates:\n\nDoS Issues F, M, J Visa Applicant Social Media Vetting Cable and Authorizes Resumption of Visa Appointment Scheduling\nJune 20, 2025\n• DoS announced new guidance on social media vetting.\n• Consulates will resume scheduling F, M, and J visa appointments.\n\nExecutive Order: Travel Ban Impacting 19 Countries\nJune 5, 2025\nA presidential proclamation created:\n• Full travel ban on 12 countries: Afghanistan, Burma, Chad, Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan, Yemen\n• Partial travel ban on 7 countries: Burundi, Cuba, Laos, Sierra Leone, South Sudan, Venezuela, Zimbabwe\n\nTemporary Delay in Scheduling New Visa Appointments for F, M, and J Visa Applicants\nJune 5, 2025\n• Temporary pause announced May 27, 2025 for new visa appointments due to expanded social media screenings.\n\nInterview Waiver – Update\nFebruary 20, 2025\n• Visa interview waiver policy revised.\n• Reversed the policy from December 21, 2023.\n\nExecutive Order to Combat Anti-Semitism\nFebruary 5, 2025\n• Executive order issued requiring universities to monitor pro-Palestinian protests.\n• For international students, participation could lead to deportation.\n\nExecutive Orders Impacting International Community\nJanuary 29, 2025\n• Multiple executive orders and agency actions affecting international students and scholars.\n• NAFSA provides detailed updates.\n\nTravel Guidance for International Students and Scholars\nJanuary 13, 2025\n• Students are highly recommended to return to the U.S. before January 20, 2025 (Presidential inauguration day).\n• Historically, new administrations have enacted restrictive policies on Day 1.\n\nSouth Africa Travel Ban Revoked\nDecember 31, 2021\n• Proclamation 10315 revoked South Africa travel ban."
  }, {
    "doc_id": "DOC067",
    "topic": "FAQs - New Students",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "FAQs – New Students\n\n(Your pasted content for this section did not include actual FAQ text beyond the heading. This entry remains as a placeholder with no additional content.)"
  }
  , {
    "doc_id": "DOC068",
    "topic": "Health Insurance",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Health Insurance\n\nSJSU Health Insurance Requirement\nAll inbound international students must purchase SJSU health insurance prior to registering for classes.\nA registration hold is placed until insurance is purchased.\nHolds removed within 48 hours of purchase.\n\nCoverage includes:\n• Accidental injury/sickness\n• Medical evacuation\n• Repatriation\n\nInstructions to Purchase the Health Insurance Plan:\n• Insurance provider: United HealthCare Student Resources (UHCSR)\n• Administered via Alliant Insurance Services\n\nSteps:\n1. Go to UHCSR website\n2. Search for 'San Jose State'\n3. Select “Medical – High Student Plan Only” → Explore Policy\n4. Click “Get Started” → Continue as Guest\n5. Select insurance category and fill required info\n6. Select semester plan\n7. Provide personal info and payment\n8. Insurance hold lifted in 24–48 hours\n\nCancellation / Refund / Exemption Policy\n\nCancellations (must email ISSS; UHCSR gives final approval)\nValid reasons:\n• Not enrolled within first 45 days\n• Drafted by military\n\nRefund deadlines:\n• Fall 2025: September 15, 2025\n• Spring 2026: February 15, 2026\n\nExemptions allowed for:\n• F-1 students with government-sponsored scholarship that includes adequate insurance\n• Students covered as dependents by employer-sponsored U.S. insurance (must purchase supplemental evacuation/repatriation)\n• J-1 ISEP Exchange participants\n\nHow to obtain your insurance ID card:\nElectronic only.\nOptions:\n• Through mobile device (uhcsr.com → MyAccount → ID Card)\n• Through school-specific UHCSR webpage\n\nWhen sick:\nRefer to instructional infographics provided by ISSS."
  }, {
    "doc_id": "DOC069",
    "topic": "Housing (duplicate heading in your paste)",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Your pasted content for Housing appears already fully included in DOC065. No additional text existed here beyond the heading itself."
  }, {
    "doc_id": "DOC070",
    "topic": "Study Tools",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Study Tools\n\n(Your pasted content referenced this heading but did not include separate text under it. All academic support tools were already captured in DOC063.)"
  }, {
    "doc_id": "DOC071",
    "topic": "Tax Information (Continuation)",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Continuation of Tax Information\n\nNEW RESOURCES FOR CPT, POST-OPT, AND STEM OPT RECIPIENTS\n\nAs students begin OPT/CPT employment, employers will require tax documents such as W-4 and other pre-employment forms.\n\nOverview of SprintaxTDS Personal:\n• Helps prepare correct pre-employment tax forms\n• Determines tax residency, FICA exemption, tax treaty eligibility\n• Generates W-4, 8233, W8-BEN, and more\n\nProcedure:\n1. Register account\n2. Complete questionnaire\n3. Pay fee\n4. Receive generated tax documents → sign → give to employer\n\nUser Guide:\n• SprintaxTDS Personal manual available for OPT/CPT\n\nCost:\n• $19.95 for form generation\n• Tax residency determination and FICA check are free before paying\n\nNote: SprintaxTDS Personal is NOT Sprintax Tax Prep.\n\nWho must file?\n• All F-1 students must file each year\n• If no income → file Form 8843\n• If income → file Federal + State tax returns\n\nRequired Federal Forms:\n• Form 8843\n• Form 1040-NR or 1040-NR-EZ\n\nRequired California Forms:\n• Form 540-NR or 540-NR-EZ\n\nDownload sources:\n• IRS website for 8843 and 1040-NR\n• California tax website for 540-NR\n\nAssistance Options:\n• Glacier\n• IRS VITA/TCE (verify if they support nonresident returns)\n• Sprintax educational videos and blog\n\nDisclaimer: ISSS cannot assist with tax preparation."
  }, 
  {
    "doc_id": "DOC072",
    "topic": "Tax Filing Requirements Summary",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Tax Filing Requirements Summary\n\nWho is required to file?\nAll F-1 students must file taxes every year, regardless of employment status.\n\nIf you did NOT work or receive taxable payments:\n• File ONLY Form 8843.\n\nIf you DID work or receive taxable payments:\n• File Federal Form 8843\n• File Federal Form 1040-NR or 1040-NR-EZ\n• File California State Form 540-NR or 540-NR-EZ\n\nWhere to get forms:\nFederal forms:\n• Form 1040-NR or 1040-NR-EZ\n• Form 8843\n\nCalifornia state forms:\n• Form 540-NR or 540-NR-EZ\n\nAdditional notes:\n• Only Nonresident Aliens receive Form 1042-S.\n• 1098-T CANNOT be used for nonresident tax returns.\n• VITA/TCE programs may not assist nonresidents—call ahead.\n• Glacier is an alternative tax software provider for nonresident taxes.\n"
  }
  , {
    "doc_id": "DOC073",
    "topic": "Step-by-Step Guide: Filing Nonresident Tax Forms",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Step-by-Step Guide: Filing Nonresident Tax Forms (F and J)\n\nDocuments needed for Sprintax:\n✔ Passport\n✔ Visa/Immigration info, including I-20 or DS-2019\n✔ SSN or ITIN (if applicable)\n✔ W-2 (if you worked)\n✔ 1042-S (if you received scholarship/fellowship income)\n✔ 1099 (if applicable)\n✔ U.S. entry/exit travel history\n✘ 1098-T – NOT used for nonresident returns\n\nProcess:\n1. Create Sprintax account (link emailed to students)\n2. Complete questionnaire\n3. Sprintax determines residency status\n4. If nonresident → Sprintax prepares Form 8843 + 1040-NR\n5. Download and print forms\n6. Sign and mail federal returns to IRS\n7. If required → file state tax return (Sprintax optionally prepares it for a fee)\n\nIf no income:\n• Sprintax generates only Form 8843\n• Must still be printed, signed, and mailed\n\nSupport:\n• Sprintax email: hello@sprintax.com\n• 24/7 Live Chat\n• Sprintax FAQs and educational videos\n\nDisclaimer:\nISSS is NOT permitted to assist with ANY tax form preparation.\n"
  }, {
    "doc_id": "DOC074",
    "topic": "SprintaxTDS Personal – Pre-employment Form Preparation",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "SprintaxTDS Personal – Pre-Employment Tax Forms for CPT/OPT\n\nPurpose:\nHelps students prepare complex pre-employment tax documents such as:\n• W-4\n• 8233\n• W-8BEN\n• FICA exemption calculation\n• Tax treaty eligibility\n\nWho can use it?\nAny nonresident beginning CPT or OPT employment.\n\nProcess:\n1. Register account\n2. Complete questionnaire\n3. Complete payment ($19.95)\n4. Sprintax generates correct forms\n5. Sign and submit forms to employer\n\nBenefits:\n• Ensures correct tax withholding\n• Prevents errors on employer onboarding documents\n• Avoids FICA over-taxation\n\nNote: This service is DIFFERENT from Sprintax Tax Prep for filing annual returns.\n"
  }
,   {
    "doc_id": "DOC075",
    "topic": "General Tax Help Resources",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "General Tax Help Resources\n\nSoftware options:\n• Sprintax – primary recommended software\n• Glacier – alternative for nonresident returns\n\nLive assistance:\n• Sprintax 24/7 live chat\n• Email support: hello@sprintax.com\n\nEducational support:\n• Sprintax YouTube videos\n• Sprintax blog (tax guides for nonresidents)\n\nFree/low-cost services:\n• IRS VITA/TCE programs (verify if they handle nonresident returns; many do not)\n\nImportant:\nUniversity staff, including ISSS, legally cannot assist with tax filing.\n"
  }, {
    "doc_id": "DOC076",
    "topic": "Tax Responsibilities Reminder",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Tax Responsibilities Reminder\n\nAll F-1 students must:\n• File Form 8843 every year (even with no income)\n• File federal and state tax returns if they earned income\n• Keep copies of all forms filed\n• Understand that filing taxes is a legal requirement\n\nImportant deadlines:\nFederal tax filing deadline: April 15, 2025\nState tax filing deadline: typically same day\n\nFailure to file taxes may create future immigration complications.\n"
  }, {
    "doc_id": "DOC077",
    "topic": "Note on Tax Residency Determination",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Note on Tax Residency Determination\n\nF-1 and J-1 students are generally nonresidents for:\n• FIRST 5 calendar years (F-1)\n• FIRST 2 calendar years (J-1)\n\nAfter this period:\n• Substantial Presence Test decides whether you become a 'resident for tax purposes'\n\nIf Sprintax determines you are a resident:\n• You cannot use Sprintax to file nonresident returns\n• You must use resident filing software instead (e.g., TurboTax)\n"
  }, {
    "doc_id": "DOC078",
    "topic": "Final University Disclaimer on Taxes",
    "source_url": "",
    "last_verified": "2025-01-30",
    "content": "Final University Disclaimer on Taxes\n\nInternational Student & Scholar Services (ISSS) and all SJSU staff:\n• Are NOT allowed to advise on taxes\n• Cannot review your tax forms\n• Cannot answer detailed IRS questions\n\nAll tax decisions must be:\n• Confirmed with Sprintax\n• Verified with IRS resources or a tax professional\n\nThis closes the full Tax Information section exactly as provided.\n"
  }
  
  
  
  

  
  

  
  
  
  
  
  
      
]






